[
    {
        "q": "Is there any concern regarding the roadmap of Andromeda migration from the legacy platform which include massive business logic, rules frameworks, and other server side services?",
        "to": "LT - Tech and LT - Product"
    },
    {
        "q": "I don't have much interest in HTML,CSS. Keeping this in mind what is my future in this team?",
        "to": "LT - Tech"
    },
    {
        "q": "We don't have a view into what each team is doing. Where is each team with the new technology stack? What are the current roadblocks? if any? Analytics? Looking for quick updates which are clear/concise. Not paragraphs from each team. ",
        "to": "LT - Tech"
    },
    {
        "q": "Steve/Vito are for enterprise only. How are the other LOB leads taking on the new capitalone.com?",
        "to": "LT - All"
    },
    {
        "q": "Did we think through on giving each LOB to have their own customized global Nav/footer?. Wouldn't that confuse the overall experience for a customer who has multiple products (ex: Card card/bank acct)?",
        "to": "LT - All"
    },
    {
        "q": "Any thoughts around adding Rewards/Travel on the main page? Having too many ads/promos (Amazon's Alexa and 5 unexpected ways credit card numbers can get stolen) on the main page is way too much info on a homepage.",
        "to": "LT - All"
    },
    {
        "q": "What will be considered as the next generation banking application? Say, something that will be norm in next 5 to 7 years. ",
        "to": "LT - All"
    },
    {
        "q": "Can we have more communication around vision and strategy? Like Rich Fairbank's strategy session, our town hall events would be a great platform for Tech & Product to share a comprehensive vision and strategy.",
        "to": "LT - All"
    },
    {
        "q": "Once the site moves to AWS, will the Iron Throne be involved in any of the production support or will we be doing microservice support?  Is there a plan in place for Iron Throne once the current production model goes away?",
        "to": "LT - Tech and LT - Product"
    },
    {
        "q": "What would be our state by EOY (in terms of Andromeda taking over)?",
        "to": "LT - Tech and LT - Product"
    },
    {
        "q": "What is your vision for \"non LOB\" specific pages on capitalone.com?",
        "to": "LT - Product"
    },
    {
        "q": "What is your vision for the architecture of the site as a single entity that comprises of multiple LOB entities?",
        "to": "LT - Tech"
    },
    {
        "q": "Does technical leadership have a plan for enterprise capabilities, including segmentation, executing business rules, A/B testing, routing, auditing, etc.?  What is it?",
        "to": "LT - Tech"
    },
    {
        "q": "The apex of beer styles are generally considered to be lagers and ales. What is your favorite style or commercial example of a style? Mead is an acceptable answer and abstaining for dietary or personal reasons is also perfectly acceptable.",
        "to": "LT - All"
    },
    {
        "q": "How can I give credit to other members we work with regularly for a job well done as they are not assigned to our team?",
        "to": "LT - All"
    },
    {
        "q": "Are there any plans in future to redesign the capitalone.com site to take advantage of the javascript frameworks we are using after we are done replicating the existing design in new technology?",
        "to": "LT - Tech and LT - Design"
    },
    {
        "q": "Regarding our migration to \"Andromeda,\" what are your integration priorities? How can we align in Richmond and in Oakland? ",
        "to": "Sandeep and Michi"
    },
    {
        "q": "How do you feel that R&D fits into the grand scheme of work done at Capital One, and how can it be leveraged to help make Capital One a true technology company?",
        "to": "LT - Tech and LT - Product"
    },
    {
        "q": "With a lot of teams working on Angular pages right now, and the idea that we'll eventually be redoing that for Angular2, what is the plan of transition for this?  When will Angular2 codebase be ready to view so teams can begin incorporating that into their pages?",
        "to": "LT - Tech"
    },
    {
        "q": "Github is making life so much easier and I'm enjoying it but how are we to know when Andromeda packages or LOB-led packages are updated and when they are, what is responsible from us to update them?",
        "to": "LT - Tech and LT - Product"
    },
    {
        "q": "I keep hearing about Andromeda's road map and I've heard different things from different people. Is there a road map beyond what Angela has posted on Pulse and if so what is it?",
        "to": "Sandeep and Michi"
    },
    {
        "q": "When is the move to Angular 2 going to happen and what can we expect for development? I understand how Angular 1 fit into the current capitalone.com platform with routing but I see a framework like Angular 2 much more built for pure app development, so I'm interested in where that will tie into the site. Will pages be giant components? Will we be doing server-side rendering?",
        "to": "LT - Tech"
    },
    {
        "q": "What does the IT leadership see as the limitations of the new platform? What does the product team see as the limitations of the new platform? ",
        "to": "LT - Tech and LT - Product"
    },
    {
        "q": "What are the expected dates to have every team (or most) on the Andromeda platform by?",
        "to": "LT - Tech and LT - Product"
    },
    {
        "q": "Are we planning on converting anymore testers to be associates? Or are we only converting UIEs and Devs?",
        "to": "LT - Tech and LT - Product"
    },
    {
        "q": "What are the plans on implementing capitalone.com with 100% andromeda stack? What are the biggest challenges for us today?",
        "to": "LT - Tech"
    },
    {
        "q": "What are your top (immediate/ needs to get done in the next month) priorities for Andromeda development?",
        "to": "LT - Tech"
    },
    {
        "q": "regarding \"a leading software development company\", are we going to sell software/services ? I thought we were a financial institute now and future.",
        "to": "LT - All"
    },
    {
        "q": "How do you see agile teams evolving as we move forward toward our goal of becoming a leading software development company?",
        "to": "LT - All"
    },
    {
        "q": "Have we finalized or published the pod level goals?",
        "to": "LT - Tech"
    },
    {
        "q": "How can product/design better communicate with the tech side of the house? They seem to be at odds sometimes.  ",
        "to": "LT - All"
    }
]
